---
kind: method
id: M:Autodesk.Revit.DB.Category.GetCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
source: html/dd25c525-ef7c-5577-382c-587af3245df6.htm
---
# Autodesk.Revit.DB.Category.GetCategory Method

Retrieves a category object corresponding to the category id.

## Syntax (C#)
```csharp
public static Category GetCategory(
	Document document,
	ElementId categoryId
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.
- **categoryId** (`Autodesk.Revit.DB.ElementId`) - An category id.

## Returns
Returns a category object corresponding to the category id.